{
  "title": "Weleho's Lair",
  "header": {
    "title": "WelehoBRUDER",
    "home": "Home",
    "about": "About",
    "contact": "Contact",
    "projects": "Projects",
    "skills": "Skills"
  },
  "footer": {
    "backToTop": "Back to Top"
  },
  "home": {
    "title": "Weleho's Lair",
    "welcome_1": "Welcome to Weleho's Lair!",
    "welcome_2": "This is my personal website where you can find out more about me and my projects.",
    "welcome_3": "I hope you enjoy your stay!"
  },
  "about": {
    "title": "About Me",
    "section_1": "I am a 20 year old software developer from Helsinki, Finland.",
    "section_2": "I have a particular passion for game development, which is reflected on my projects.\nAnd though game development is why I learned to code, programming in general has also become one of my favourite hobbies.",
    "section_3": "My current project is called 'Dungeons of Tavaraen', you can learn more about it and other games I have created down below.",
    "currentWork": "I currently work at",
    "currentWorkplace": "Virittämö Helsinki",
    "currentWorkRole": "as a Frontend Developer."
  },
  "projects": {
    "title": "Projects",
    "link": "Try it",
    "repo": "Repository",
    "contentTime": "Completion time",
    "mainLanguage": "Scripting language",
    "styleLanguage": "Styling language",
    "framework": "Framework"
  },
  "project": {
    "Dungeons_of_Tavaraen": {
      "shortDesc": "Roguelite RPG inspired by Tales of Maj'Eyal. Currently my most actively developed project, give it a try if you're interested!",
      "longDesc": "Dungeons of Tavaraen is a roguelite game inspired by Tales of Maj'Eyal. It is based on a grid/tile movement system that dictates everything about combat. The game is still somewhat early in development, so expect to see bugs and unfinished features."
    },
    "Memory_Cards": {
      "shortDesc": "Simple memory card game based on Dark Souls III, made to practice React."
    },
    "Pohjola_II": {
      "shortDesc": "Turn based fighting game mostly made during one weekend. My most 'complete' project to date."
    },
    "Pohjola_III": {
      "shortDesc": "Turn based fighting game based on its prequel Pohjola II. Abandoned in favour of Dungeons of Tavaraen."
    },
    "Tears_of_the_Evertree": {
      "shortDesc": "TOTE was supposed to be my main project, it had plenty of time dedicated to it. Unfortunately, it is now an abandoned game."
    },
    "My_Road": {
      "shortDesc": "One of my earlier games, started because I didn't have internet one day and decided to program an interface. Had some simple attempts at creating an AI opponent."
    }
  },
  "technologies": {
    "title": "Technologies",
    "text": "These are the technologies I have either used in my projects or have decent knowledge of. If you are in need of a different stack, I am always willing to grow my list of skills!"
  }
}
